class Stemmer

  @@endings = "а|ам|ами|ах|та|в|вав|вавсь|вався|вала|валась|валася|вали|вались|валися|вало|валось|валося|вати|ватись|ватися|всь|вся|е|ей|еві|ем|ею|є|ємо|ємось|ємося|ється|єте|єтесь|єтеся|єш|єшся|єю|и|ив|ий|ила|или|ило|илося|им|ими|имо|имось|имося|ите|итесь|итеся|ити|ить|иться|их|иш|ишся|й|ймо|ймось|ймося|йсь|йся|йте|йтесь|йтеся|і|ів|ій|ім|імо|ість|істю|іть|ії|ія|ї|к|ки|ла|лась|лася|ло|лось|лося|ли|лись|лися|ні|о|ові|ове|овував|овувала|овувати|овані|ого|ої|ок|ом|ому|осте|ості|очка|очкам|очками|очках|очки|очків|очкові|очком|очку|очок|ою|ти|ть|тись|тися|у|ував|увала|увати|ь|чних|ці|ю|юст|юсь|юся|ють|ються|я|ям|ями|ях"

  def initialize
    @regexp = Regexp.new("(#{@@endings})$")
  end

  def stem_words(words)
    # [ { word: 'Hello', start: 2, length: 5 } ]
    words.map do |word| 
      { word: stem(word[:word]), start: word[:start], length: word[:length] }
    end
  end

  def stem(word)
    word.gsub(@regexp, '')
  end
end